0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    farfields
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    duct
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
    fan_in
    {
        type            fan;
        patchType       cyclic;
        jump            uniform 0;
        value           uniform 0;
        jumpTable       polynomial
        1((100 0));
    }
    fan_out
    {
        type            fan;
        patchType       cyclic;
        value           uniform 0;
    }
}


// ************************************************************************* //
