constant/section/section_profile.z0
( 0.3500502481343934 0.010049751249899798 -0.1 )
( 0.3502009925375737 0.020099502499799596 -0.1 )
( 0.3504522332095409 0.030149253749699394 -0.1 )
( 0.35080397015029485 0.04019900499959919 -0.1 )
( 0.35125620335983576 0.05024875624949899 -0.1 )
( 0.3518089328381635 0.06029850749939879 -0.1 )
( 0.35246215858527813 0.07034825874929858 -0.1 )
( 0.3532158806011796 0.08039800999919838 -0.1 )
( 0.35407009888586793 0.09044776124909819 -0.1 )
