system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
     			           						   
// scale   0.001;

vertices
(
	// Vertices on z=-0.1 plane
	(0 -3 -0.1)
	(0 -0.1 -0.1)
	(0 0 -0.1)
	(0 0.10049751249899798 -0.1)
	(0 0.174246212024584 -0.1)
	(0 3 -0.1)

	(0.25 -3 -0.1)
	(0.25 -0.1 -0.1)
	(0.25 0 -0.1)
	(0.255024813439343 0.10049751249899798 -0.1)
	(0.285753787975416 0.174246212024584 -0.1)
	(0.285753787975416 3 -0.1)

	(0.35 -3 -0.1)
	(0.35 -0.1 -0.1)
	(0.35 0 -0.1)
	(0.3550248134393431 0.10049751249899798 -0.1)
	(0.356464466094067 0.103535533905933 -0.1)

	(0.355 -3 -0.1)
	(0.355 -0.1 -0.1)
	(0.3649937539038101 0.09975015615240475 -0.1)
	(0.363535533905933 0.103535533905933 -0.1)

	(0.455 -3 -0.1)
	(0.455 -0.1 -0.1)
	(0.46499375390381 0.09975015615240475 -0.1)
	(0.434246212024584 0.174246212024584 -0.1)
	(0.434246212024584 3 -0.1)

	(3 -3 -0.1)
	(3 -0.1 -0.1)
	(3 0.09975015615240475 -0.1)
	(3 0.174246212024584 -0.1)
	(3 3 -0.1)

	// Vertices on z=0.1 plane
	(0 -3 0.1)
	(0 -0.1 0.1)
	(0 0 0.1)
	(0 0.10049751249899798 0.1)
	(0 0.174246212024584 0.1)
	(0 3 0.1)

	(0.25 -3 0.1)
	(0.25 -0.1 0.1)
	(0.25 0 0.1)
	(0.255024813439343 0.10049751249899798 0.1)
	(0.285753787975416 0.174246212024584 0.1)
	(0.285753787975416 3 0.1)

	(0.35 -3 0.1)
	(0.35 -0.1 0.1)
	(0.35 0 0.1)
	(0.3550248134393431 0.10049751249899798 0.1)
	(0.356464466094067 0.103535533905933 0.1)

	(0.355 -3 0.1)
	(0.355 -0.1 0.1)
	(0.3649937539038101 0.09975015615240475 0.1)
	(0.363535533905933 0.103535533905933 0.1)

	(0.455 -3 0.1)
	(0.455 -0.1 0.1)
	(0.46499375390381 0.09975015615240475 0.1)
	(0.434246212024584 0.174246212024584 0.1)
	(0.434246212024584 3 0.1)

	(3 -3 0.1)
	(3 -0.1 0.1)
	(3 0.09975015615240475 0.1)
	(3 0.174246212024584 0.1)
	(3 3 0.1)
);

blocks
(
	hex 
	(0 6 7 1 31 37 38 32) (40 80 1)
	simpleGrading (1 0.05 1)

	hex 
	(1 7 8 2 32 38 39 33) (40 20 1)
	simpleGrading (1 1 1)

	hex 
	(2 8 9 3 33 39 40 34) (40 20 1)
	simpleGrading (1 1 1)

	hex 
	(3 9 10 4 34 40 41 35) (40 20 1)
	simpleGrading (1 1 1)

	hex 
	(4 10 11 5 35 41 42 36) (40 80 1)
	simpleGrading (1 20 1)

	hex 
	(6 12 13 7 37 43 44 38) (30 80 1)
	simpleGrading (0.1 0.05 1)

	hex 
	(7 13 14 8 38 44 45 39) (30 20 1)
	simpleGrading (0.1 1 1)

	hex 
	(8 14 15 9 39 45 46 40) (30 20 1)
	simpleGrading (0.1 1 1)

	hex 
	(9 15 16 10 40 46 47 41) (30 20 1)
	simpleGrading (0.1 1 1)

	hex 
	(10 16 20 24 41 47 51 55) (30 40 1)
	simpleGrading (0.1 1 1)

	hex 
	(19 23 24 20 50 54 55 51) (30 20 1)
	simpleGrading (10 1 1)

	hex 
	(18 22 23 19 49 53 54 50) (30 40 1)
	simpleGrading (10 1 1)

	hex 
	(17 21 22 18 48 52 53 49) (30 80 1)
	simpleGrading (10 0.05 1)

	hex 
	(12 17 18 13 43 48 49 44) (5 80 1)
	simpleGrading (1 0.05 1)

	hex 
	(10 24 25 11 41 55 56 42) (40 80 1)
	simpleGrading (1 20 1)

	hex 
	(21 26 27 22 52 57 58 53) (80 80 1)
	simpleGrading (20 0.05 1)

	hex 
	(22 27 28 23 53 58 59 54) (80 40 1)
	simpleGrading (20 1 1)

	hex 
	(23 28 29 24 54 59 60 55) (80 20 1)
	simpleGrading (20 1 1)
	
	hex 
	(24 29 30 25 55 60 61 56) (80 80 1)
	simpleGrading (20 20 1)
);

  
edges
(
	arc 15 16 (0.356786061951567 0.103830222215595 -0.1)
	arc 46 47 (0.356786061951567 0.103830222215595 0.1)

	arc 16 20 (0.36 0.105 -0.1)
	arc 47 51 (0.36 0.105 0.1)

	arc 19 20 (0.363213938048432 0.103830222215595 -0.1)
	arc 50 51 (0.363213938048432 0.103830222215595 0.1)

	BSpline 14 15
	(
		( 0.3500502481343934 0.010049751249899798 -0.1 )
( 0.3502009925375737 0.020099502499799596 -0.1 )
( 0.3504522332095409 0.030149253749699394 -0.1 )
( 0.35080397015029485 0.04019900499959919 -0.1 )
( 0.35125620335983576 0.05024875624949899 -0.1 )
( 0.3518089328381635 0.06029850749939879 -0.1 )
( 0.35246215858527813 0.07034825874929858 -0.1 )
( 0.3532158806011796 0.08039800999919838 -0.1 )
( 0.35407009888586793 0.09044776124909819 -0.1 )

	)

	BSpline 45 46
	(
		( 0.3500502481343934 0.010049751249899798 0.1 )
( 0.3502009925375737 0.020099502499799596 0.1 )
( 0.3504522332095409 0.030149253749699394 0.1 )
( 0.35080397015029485 0.04019900499959919 0.1 )
( 0.35125620335983576 0.05024875624949899 0.1 )
( 0.3518089328381635 0.06029850749939879 0.1 )
( 0.35246215858527813 0.07034825874929858 0.1 )
( 0.3532158806011796 0.08039800999919838 0.1 )
( 0.35407009888586793 0.09044776124909819 0.1 )

	)
);

 
boundary
(
    farfields
    {
        type patch;
        faces
        (
            (1 0 31 32)
            (2 1 32 33)
            (3 2 33 34)
            (4 3 34 35)
            (5 4 35 36)
            (11 5 36 42)
            (25 11 42 56)
            (30 25 56 61)
            (29 30 61 60)
            (28 29 60 59)
            (27 28 59 58)
            (26 27 58 57)
        );
    }

	lowerWall
	{
		type	patch;
		faces
		(
			(0 6 37 31)
			(6 12 43 37)
			(12 17 48 43)
			(17 21 52 48)
			(21 26 57 52)
		);
	}

	duct
	{
		type	wall;
		faces
		(
			(13 14 45 44)
			(14 15 46 45)
			(15 16 47 46)
			(16 20 51 47)
			(20 19 50 51)
			(19 18 49 50)
			(18 13 44 49)
		);
	}
);

// ************************************************************************* //
