system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

	pFinal
	{
		$p;
		relTol	0;
	}

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          PBiCGStab;
		preconditioner	DILU;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

	"(U|k|omega)Final"
	{
		$U;
		relTol	0;
	}
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-2;
        U               1e-3;
        "(k|epsilon|omega|f|v2)" 1e-3;
    }

	pRefPoint (0 2.9 0);
	pRefValue 0;
}

PIMPLE
{
	nOuterCorrectors	5;
	nCorrectors			2;
	nNonOrthogonalCorrectors	0;
	pRefPoint			(0 2.9 0);
	pRefValue			0;
	transimple			yes;
	limitMagU			30;
}

relaxationFactors
{
	fields
	{
		p			0.3;
	}
    equations
    {
		"U.*"			0.7;
		"(k|omega).*"	0.5;
    }
}


// ************************************************************************* //
